<?php

return [
    'gender' => [1 => '男', 2 => '女'],
    'degree' => [1 => '大专', 2 => '本科', 3 => '研究生', 4 => '博士'],
    'service' => [
        'status' => [1 => '在职', 2 => '离职']
    ],
    'salary' => [1 => '面议', 2 => '10000以下', 3 => '10000 ~ 20000', 4 => '20000 ~ 30000', 5 => '30000以上'],
    'alerttype' => [
        ['id' => '1', 'text' => '候选人电话'],
        ['id' => '2', 'text' => '联系中'],
        ['id' => '3', 'text' => '意向中'],
        ['id' => '4', 'text' => '推荐中'],
        ['id' => '5', 'text' => '面试中'],
        ['id' => '6', 'text' => 'offer中'],
        ['id' => '7', 'text' => '入职中'],
        ['id' => '8', 'text' => '试用期结束'],
        ['id' => '9', 'text' => '预计到款'],
        ['id' => '10', 'text' => '其他']],
    'welfare' => [
        ['id' => '1', 'text' => '五险一金全额缴纳'],
        ['id' => '2', 'text' => '五险一金比例缴纳']],
    'worktime' => [
        ['id' => '1', 'text' => '朝九晚六'],
        ['id' => '2', 'text' => '996'],
        ['id' => '3', 'text' => '弹性时间'],
        ['id' => '4', 'text' => '其他']],
    'financing' => [
        ['id' => '1', 'text' => 'a轮前'],
        ['id' => '2', 'text' => 'b轮'],
        ['id' => '3', 'text' => 'c轮'],
        ['id' => '4', 'text' => 'd轮'],
        ['id' => '5', 'text' => '上市公司'],
        ['id' => '6', 'text' => '不用融资']],
    'industry' => [
        1 => '互联网软件',
        2 => '金融投资',
        3 => '消费品',
        4 => '能源',
        5 => '医疗',
        6 => '地产',
        7 => '服务业',
        8 => '传媒',
        9 => '其他'
    ],
    'ranking' => [
        ['id' => '1', 'text' => '第一名'],
        ['id' => '2', 'text' => '前三名'],
        ['id' => '3', 'text' => '新创企业']],
    'company' => [
        'property' => [
            1 => '外商独资/外企办事处',
            2 => '中外合营(合资/合作)',
            3 => '私营/民营企业',
            4 => '国有企业',
            5 => '国内上市公司',
            6 => '政府机关／非盈利机构',
            7 => '事业单位',
            8 => '其他'
        ],
        'size' => [
            1 => '1-49人',
            2 => '50-99人',
            3 => '100-499人',
            4 => '500-999人',
            5 => '1000-2000人',
            6 => '2000-5000人',
            7 => '5000-10000人',
            8 => '10000人以上'
        ],

        'level' => [
            1 => '1级',
            2 => '2级',
            3 => '3级'
        ],
        'type' => [
            1 => '未签约',
            2 => '已签约',
            3 => '有成交'
        ],
    ],
    'project' => [
        'status' => [
            0 => '未审核',
            1 => '通过',
            2 => '拒绝'
        ],
    ],
    'workyears' => [
        1 => '三年以下',
        2 => '三年以上',
        3 => '五年以上',
        4 => '八年以上',
        5 => '十年以上',
        6 => '二十年以上'
    ],
    'majors' => [
        1 => '计算机相关',
        2 => '会计相关',
        3 => '金融相关',
        4 => '专业相关',
        5 => '其他'
    ],
];
