<?php

return [
    'gender' => [1 => '男', 2 => '女'],
    'degree' => [1 => '大专', 2 => '本科', 3 => '研究生', 4 => '博士'],
    'servicestatus' => [
        ['id' => '1', 'text' => '在职'],
        ['id' => '2', 'text' => '离职']],
    'salary' => [
        ['id' => '1', 'text' => '面议'],
        ['id' => '2', 'text' => '10000以下'],
        ['id' => '3', 'text' => '10000 ~ 20000'],
        ['id' => '4', 'text' => '20000 ~ 30000'],
        ['id' => '5', 'text' => '30000以上']],
    'alerttype' => [
        ['id' => '1', 'text' => '候选人电话'],
        ['id' => '2', 'text' => '联系中'],
        ['id' => '3', 'text' => '意向中'],
        ['id' => '4', 'text' => '推荐中'],
        ['id' => '5', 'text' => '面试中'],
        ['id' => '6', 'text' => 'offer中'],
        ['id' => '7', 'text' => '入职中'],
        ['id' => '8', 'text' => '试用期结束'],
        ['id' => '9', 'text' => '预计到款'],
        ['id' => '10', 'text' => '其他']],
    'welfare' => [
        ['id' => '1', 'text' => '五险一金全额缴纳'],
        ['id' => '2', 'text' => '五险一金比例缴纳']],
    'worktime' => [
        ['id' => '1', 'text' => '朝九晚六'],
        ['id' => '2', 'text' => '996'],
        ['id' => '3', 'text' => '弹性时间'],
        ['id' => '4', 'text' => '其他']],
    'financing' => [
        ['id' => '1', 'text' => 'a轮前'],
        ['id' => '2', 'text' => 'b轮'],
        ['id' => '3', 'text' => 'c轮'],
        ['id' => '4', 'text' => 'd轮'],
        ['id' => '5', 'text' => '上市公司'],
        ['id' => '6', 'text' => '不用融资']],
    'industry' => [
        1 => '互联网软件',
        2 => '金融投资',
        3 => '消费品',
        4 => '能源',
        5 => '医疗',
        6 => '地产',
        7 => '服务业',
        8 => '传媒',
        9 => '其他'
    ],
    'ranking' => [
        ['id' => '1', 'text' => '第一名'],
        ['id' => '2', 'text' => '前三名'],
        ['id' => '3', 'text' => '新创企业']],
    'companyproperty' => [
        1 => '外商独资/外企办事处',
        2 => '中外合营(合资/合作)',
        3 => '私营/民营企业',
        4 => '国有企业',
        5 => '国内上市公司',
        6 => '政府机关／非盈利机构',
        7 => '事业单位',
        8 => '其他'
    ],
    'companysize' => [
        ['id' => '1', 'text' => '1-49人'],
        ['id' => '2', 'text' => '50-99人'],
        ['id' => '3', 'text' => '100-499人'],
        ['id' => '4', 'text' => '500-999人'],
        ['id' => '5', 'text' => '1000-2000人'],
        ['id' => '6', 'text' => '2000-5000人'],
        ['id' => '7', 'text' => '5000-10000人'],
        ['id' => '8', 'text' => '10000人以上']],
    'workyears' => [
        ['id' => '1', 'text' => '三年以下'],
        ['id' => '2', 'text' => '三年以上'],
        ['id' => '3', 'text' => '五年以上'],
        ['id' => '4', 'text' => '八年以上'],
        ['id' => '5', 'text' => '十年以上'],
        ['id' => '6', 'text' => '二十年以上']],
    'majors' => [
        ['id' => '1', 'text' => '计算机相关'],
        ['id' => '2', 'text' => '会计相关'],
        ['id' => '3', 'text' => '金融相关'],
        ['id' => '4', 'text' => '专业相关'],
        ['id' => '5', 'text' => '其他']],
    'companylevel' => [
        ['id' => '2', 'text' => '1级'],
        ['id' => '3', 'text' => '2级'],
        ['id' => '4', 'text' => '3级']],
    'companytype' => [
        ['id' => '2', 'text' => '未签约'],
        ['id' => '3', 'text' => '已签约'],
        ['id' => '4', 'text' => '有成交']],
    'projectstatus' => [
        ['id' => '2', 'text' => '通过'],
        ['id' => '3', 'text' => '拒绝']],
];
