<?php

return [

    'gender' => [
        ['id' => '0', 'text' => '男'],
        ['id' => '1', 'text' => '女']],
    'degree' => [
        ['id' => '0', 'text' => '大专'],
        ['id' => '1', 'text' => '本科'],
        ['id' => '2', 'text' => '研究生'],
        ['id' => '3', 'text' => '博士']],
    'servicestatus' => [
        ['id' => '0', 'text' => '在职'],
        ['id' => '1', 'text' => '离职']],
    'salary' => [
        ['id' => '0', 'text' => '面议'],
        ['id' => '1', 'text' => '10000以下'],
        ['id' => '2', 'text' => '10000 ~ 20000'],
        ['id' => '3', 'text' => '20000 ~ 30000'],
        ['id' => '4', 'text' => '30000以上']],
    'alerttype' => [
        ['id' => '0', 'text' => '候选人电话'],
        ['id' => '1', 'text' => '联系中'],
        ['id' => '2', 'text' => '意向中'],
        ['id' => '3', 'text' => '推荐中'],
        ['id' => '4', 'text' => '面试中'],
        ['id' => '5', 'text' => 'offer中'],
        ['id' => '6', 'text' => '入职中'],
        ['id' => '7', 'text' => '试用期结束'],
        ['id' => '8', 'text' => '预计到款'],
        ['id' => '9', 'text' => '其他']],
    'welfare' => [
        ['id' => '0', 'text' => '五险一金全额缴纳'],
        ['id' => '1', 'text' => '五险一金基数缴纳']],
    'worktime' =>[
        ['id' => '0', 'text' => '朝九晚六'],
        ['id' => '1', 'text' => '996'],
        ['id' => '2', 'text' => '弹性时间'],
        ['id' => '3', 'text' => '其他']],
    'financing' => [
        ['id' => '0', 'text' =>'a轮前'],
        ['id' => '1', 'text' => 'b轮'],
        ['id' => '2', 'text' => 'c轮'],
        ['id' => '3', 'text' => 'd轮'],
        ['id' => '4', 'text' => '上市公司'],
        ['id' => '5', 'text' => '不用融资']],
    'industry' => [
        ['id' => '0', 'text' => '互联网软件'],
        ['id' => '1', 'text' => '金融投资'],
        ['id' => '2', 'text' => '消费品'],
        ['id' => '3', 'text' => '能源'],
        ['id' => '4', 'text' => '医疗'],
        ['id' => '5', 'text' => '地产'],
        ['id' => '6', 'text' => '服务业'],
        ['id' => '7', 'text' => '传媒'],
        ['id' => '8', 'text' => '其他']],
    'ranking' => [
        ['id' => '0', 'text' => '第一名'],
        ['id' => '1', 'text' => '前三名'],
        ['id' => '2', 'text' => '新创企业']],
    'companytype' => [
        ['id' => '0', 'text' => '外商独资/外企办事处'],
        ['id' => '1', 'text' => '中外合营(合资/合作)'],
        ['id' => '2', 'text' => '私营/民营企业'],
        ['id' => '3', 'text' => '国有企业'],
        ['id' => '4', 'text' => '国内上市公司'],
        ['id' => '5', 'text' => '政府机关／非盈利机构'],
        ['id' => '6', 'text' => '事业单位'],
        ['id' => '7', 'text' => '其他']],
    'companysize' => [
        ['id' => '0', 'text' => '1-49人'],
        ['id' => '1', 'text' => '50-99人'],
        ['id' => '2', 'text' => '100-499人'],
        ['id' => '3', 'text' => '500-999人'],
        ['id' => '4', 'text' => '1000-2000人'],
        ['id' => '5', 'text' => '2000-5000人'],
        ['id' => '6', 'text' => '5000-10000人'],
        ['id' => '7', 'text' => '10000人以上']],
    'workyears' => [
        ['id' => '0', 'text' => '不限'],
        ['id' => '1', 'text' => '三年以下'],
        ['id' => '2', 'text' => '三年以上'],
        ['id' => '3', 'text' => '五年以上'],
        ['id' => '4', 'text' => '八年以上'],
        ['id' => '5', 'text' => '十年以上'],
        ['id' => '6', 'text' => '二十年以上']],
    'majors' => [
        ['id' => '0', 'text' => '不限'],
        ['id' => '1', 'text' => '计算机相关'],
        ['id' => '2', 'text' => '会计相关'],
        ['id' => '3', 'text' => '金融相关'],
        ['id' => '4', 'text' => '专业相关'],
        ['id' => '5', 'text' => '其他']]
];